---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.Dispose
source: html/daa92a17-48ad-264e-8a7d-d2a8de070508.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.Dispose Method

Releases all resources used by the ExporterIFC

## Syntax (C#)
```csharp
public void Dispose()
```